package main

/*
с) Создать приложение с тремя потоками. Каждый поток работает со
своим массивом, потоки проверяют сумму элементов своего массива с суммами элементов других потоков и останавливаются,
когда все три суммы равны между собой. Если суммы не равны, каждый поток прибавляет единицу к одному элементу массива
или отнимает единицу от одного элемента массива, затем снова проверяет условие равенства сумм. На момент останов-
ки всех трех потоков, суммы элементов массивов должны быть одинаковы.
*/

func main() {

}
