package main

/*
Задача о новобранцах. Строю новобранцев дается команда «налево»
или «направо». Все новобранцы стараются исполнить приказ, но проблема в
том, что они не знают где право, а где лево. Следовательно, каждый новобра-
нец поворачивается либо направо, либо налево. Если новобранец повернулся
и видит, что его сосед стоит к нему спиной, он считает, что все сделал пра-
вильно. Если же они сталкиваются лицом к лицу, то оба считают, что ошиб-
лись, и разворачиваются на 180 градусов. Создать многопоточное приложе-
ние, моделирующее поведение строя новобранцев, пока он не придет к ста-
ционарному состоянию. Количество новобранцев ≥ 100. Отдельный поток
отвечает за часть строя не менее 50 новобранцев.
*/

func main() {

}

